# GetHashCode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryObject..::..GetHashCode Method
GeometryObject Class See Also
---
Gets the integer value of the geometry object as hash code
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override int GetHashCode()
```

Visual Basic
---
```text
Public Overrides Function GetHashCode As Integer
```

Visual C++
---
```text
public:
virtual int GetHashCode() override
```

# See Also
GeometryObject Class
Autodesk.Revit.DB Namespace